# Exploratory data analysis

In this notebook we will perform any data processing that is required in order to be able to load the provided data into a Pandas based dataframe. Then we will take a quick look at each feature with the intention of discovering superficial patterns that hopefully will aid and inspire us for modeling.

***The answer to the first question can be found here: ***
- [Answer to first question](#cell_first_question)


## Data processing

In [2]:
import json
from os import path
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb
import pandas as pd
import pandas_profiling

%matplotlib inline
plt.rcParams['figure.figsize'] = [15, 7]

We will load our data into json format and then parse it into a pandas dataframe.

In [3]:
df_original = pd.read_json('data/original/city_search.json')

In [4]:
df_original.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20022 entries, 0 to 20021
Data columns (total 4 columns):
session_id        20022 non-null object
unix_timestamp    20022 non-null object
cities            20022 non-null object
user              20022 non-null object
dtypes: object(4)
memory usage: 625.8+ KB

***Observations***
- We have 20022 non-null rows.
- The data type for each column is object. This is incorrect since we know that we have dates and numbers in our data.

Let's have a look at the first few lines to verify this.

In [5]:
df_original.head()

,session_id,unix_timestamp,cities,user
0,[X061RFWB06K9V],[1442503708],"[New York NY, Newark NJ]","[[{'user_id': 2024, 'joining_date': '2015-03-2..."
1,[5AZ2X2A9BHH5U],[1441353991],"[New York NY, Jersey City NJ, Philadelphia PA]","[[{'user_id': 2853, 'joining_date': '2015-03-2..."
2,[SHTB4IYAX4PX6],[1440843490],[San Antonio TX],"[[{'user_id': 10958, 'joining_date': '2015-03-..."
3,[JBRB8MZGTX3M4],[1427268063],[Edmonton AB],"[[{'user_id': 7693, 'joining_date': '2015-03-1..."
4,[YJCMPURC2FL9C],[1430559067],"[Phoenix AZ, Houston TX]","[[{'user_id': 7506, 'joining_date': '2015-02-2..."

Our dataframe contains json formatted strings inside its cells. Let's open the file as json and then parse it into a pandas dataframe. This will allow us to flatten the data and therefore be able to access it and analyze it with our tools of preference (pandas).

In [6]:
# Open json file into a dictionary
with open('data/original/city_search.json', 'r') as f:
    city_search_dict = json.load(f)

In [7]:
city_search_dict[0]

{'session_id': ['X061RFWB06K9V'],
 'unix_timestamp': [1442503708],
 'cities': ['New York NY, Newark NJ'],
 'user': [[{'user_id': 2024, 'joining_date': '2015-03-22', 'country': 'UK'}]]}

In [8]:
# This method will transform the dictionary that we created from the json above into a pandas dataframe
def create_dataframe(city_search_dict):
    df_flat = pd.DataFrame(columns =  ['session_id', 'unix_timestamp', 'cities', 'user_id', 'joining_date', 'country'])  
    for idx, search in enumerate(city_search_dict):
        for usr_det in search['user'][0]:
            user_id = usr_det['user_id']
            joining_date = usr_det['joining_date']
            country = usr_det['country']
        
    df_flat.loc[idx] = [search['session_id'][0], search['unix_timestamp'][0], search['cities'][0], user_id, joining_date, country]

In [9]:
# Call the method to create the datafrma from dictionary if it hasn't been done before. Otherwise load the already
# created file from csv to dataframe

if path.exists('data/flattened/df_city_search.csv') == False:
    # Transform the dictionary into a pandas df
    df_flat = create_dataframe(city_search_dict)
    # Save it to disk
    df_flat.to_csv('data/flattened/df_city_search.csv', index = None, header=True)
else:
    df_flat = pd.read_csv('data/flattened/df_city_search.csv')

We have now finished processing our data so we can explore it with python. From now on as we execute this notebook we won't preprocess it every time, instead we will load it from the place we saved it at the first time we process it.

In [10]:
# Make sure that Nan is encoded as ''. Otherwise the code that follows might not work as expected
df_flat.replace(np.nan, '', regex=True, inplace=True)
df_flat.head(10)

,session_id,unix_timestamp,cities,user_id,joining_date,country
0,X061RFWB06K9V,1442503708,"New York NY, Newark NJ",2024,2015-03-22,UK
1,5AZ2X2A9BHH5U,1441353991,"New York NY, Jersey City NJ, Philadelphia PA",2853,2015-03-28,DE
2,SHTB4IYAX4PX6,1440843490,San Antonio TX,10958,2015-03-06,UK
3,JBRB8MZGTX3M4,1427268063,Edmonton AB,7693,2015-03-12,IT
4,YJCMPURC2FL9C,1430559067,"Phoenix AZ, Houston TX",7506,2015-02-28,UK
5,LKOKP80QD6BEO,1434199991,San Diego CA,3743,2015-03-04,ES
6,YOVUIM79SGS5Y,1443171887,"Montreal QC, Chicago IL",8831,2015-03-02,
7,SHXEY67QWKP9K,1431766104,"Calgary AB, New York NY",587,2015-03-16,
8,9P74JL5KMC9G9,1434816246,"Chicago IL, New York NY",365,2015-03-22,US
9,UY49RTVRX3GL7,1439104667,New York NY,5995,2015-03-21,

Let's move on to the data analysis part of the project. We will start by studying the features one by one to see what insights naturally bubble up to the surface.

## Space of possible cities

Let's now extract the cities from the data to create a list of all the possible cities. This will help us tokenize our city sequences in order to train sequential models down the line.

In [15]:
df_flat['cities'].unique()

array(['New York NY, Newark NJ',
       'New York NY, Jersey City NJ, Philadelphia PA', 'San Antonio TX',
       ..., 'Edmonton AB, Houston TX, Toronto ON, Los Angeles CA',
       'San Diego CA, New York NY, Houston TX',
       'Houston TX, Chicago IL, Los Angeles CA'], dtype=object)

In [16]:
def extract_cities(dataframe):
    city_set = set()
    for index, row in dataframe.iterrows():
        searched_cities = [city.strip() for city in row['cities'].split(",")]

        for city in searched_cities:
            city_set.add(city)
    city_list = list(city_set)
    return city_list

In [17]:
# Convert set to list
city_list = extract_cities(df_flat)
# Sort cities in alphabetical orther for reproducibility purposes.
city_list.sort()

print(city_list)
print(len(city_list))

with open('data/city_list.json', 'w') as json_file:
    json.dump({'city_list':city_list}, json_file)

['Anaheim CA', 'Arlington TX', 'Atlanta GA', 'Austin TX', 'Bakersfield CA', 'Baltimore MD', 'Birmingham AL', 'Boston MA', 'Buffalo NY', 'Calgary AB', 'Chandler AZ', 'Charlotte NC', 'Chesapeake VA', 'Chicago IL', 'Cincinnati OH', 'Cleveland OH', 'Columbus OH', 'Corpus Christi TX', 'Dallas TX', 'Detroit MI', 'Edmonton AB', 'Fort Wayne IN', 'Fort Worth TX', 'Fresno CA', 'Glendale AZ', 'Greensboro NC', 'Halifax NS', 'Hamilton ON', 'Hialeah FL', 'Houston TX', 'Indianapolis IN', 'Jacksonville FL', 'Jersey City NJ', 'Kansas City MO', 'Kitchener ON', 'Lexington KY', 'Lincoln NE', 'London ON', 'Long Beach CA', 'Los Angeles CA', 'Louisville KY', 'Madison WI', 'Memphis TN', 'Mesa AZ', 'Miami FL', 'Milwaukee WI', 'Minneapolis MN', 'Montreal QC', 'Nashville TN', 'New Orleans LA', 'New York NY', 'Newark NJ', 'Norfolk VA', 'OTTAWA ON', 'Oakland CA', 'Oklahoma City OK', 'Omaha NE', 'Oshawa ON', 'Philadelphia PA', 'Phoenix AZ', 'Pittsburgh PA', 'Plano TX', 'Portland OR', 'Quebec QC', 'Raleigh NC', 'Riverside CA', 'Sacramento CA', 'Saint Catharines-Niagara ON', 'Saint Paul MN', 'Saint Petersburg FL', 'San Antonio TX', 'San Diego CA', 'San Francisco CA', 'San Jose CA', 'Santa Ana CA', 'Scottsdale AZ', 'Seattle WA', 'Stockton CA', 'Tampa FL', 'Toledo OH', 'Toronto ON', 'Tucson AZ', 'Tulsa OK', 'Vancouver BC', 'Victoria BC', 'Virginia Beach VA', 'WASHINGTON DC', 'Wichita KS', 'Windsor ON']
89

We are working with 89 different cities.

## Feature engineering

Let's take a look at our features independently, maybe we will discover some interesting patterns.

In [18]:
# Transform the ids to strings in the dataframe so they are seen as categorical variables by pandas
df_flat['user_id'] = df_flat.apply(lambda row: str(row['user_id']), axis=1)

#### Feature engineering: cities_searched

Let's create a new feature that will describe the number of cities per search. This will make our task of exploring city related features easier.

In [19]:
df_flat['cities_searched'] = df_flat.apply(lambda row: row['cities'].count(',')+1, axis=1)

In [20]:
df_flat.head()

,session_id,unix_timestamp,cities,user_id,joining_date,country,cities_searched
0,X061RFWB06K9V,1442503708,"New York NY, Newark NJ",2024,2015-03-22,UK,2
1,5AZ2X2A9BHH5U,1441353991,"New York NY, Jersey City NJ, Philadelphia PA",2853,2015-03-28,DE,3
2,SHTB4IYAX4PX6,1440843490,San Antonio TX,10958,2015-03-06,UK,1
3,JBRB8MZGTX3M4,1427268063,Edmonton AB,7693,2015-03-12,IT,1
4,YJCMPURC2FL9C,1430559067,"Phoenix AZ, Houston TX",7506,2015-02-28,UK,2

In [21]:
df_flat['cities_searched'].describe()

count    20022.000000
mean         1.648986
std          0.874272
min          1.000000
25%          1.000000
50%          1.000000
75%          2.000000
max         11.000000
Name: cities_searched, dtype: float64

#### Feature engineering: tokenized sequences

Let's create a feature that will encode the search sequences as lists of integers (we'll call them tokens). This feature will be of crucial importance since we will use it directly to represent one search session which corresponds to each datapoint. It will also be used to pass into our models in the next section.

In [22]:
def tokenize_sequence(sequence_str):
    raw_sequence = [city.strip() for city in sequence_str.split(",")]
    token_sequence = []
    for city in raw_sequence:
        token_sequence.append(city_list.index(city)+1)
    
    return token_sequence

In [23]:
# Tokenize the search sequences
df_flat['city_integer_sequence'] = df_flat['cities'].apply(tokenize_sequence)

In [24]:
print('Original search: ' + str(df_flat['cities'].values[0]))
print('Tokenized search: ' + str(df_flat['city_integer_sequence'].values[0]))

Original search: New York NY, Newark NJ
Tokenized search: [51, 52]

#### Feature engineering: binary sequences

Let's also create a binary representation of each search so that the value of the token of each city searched is positionaly encoded as one in a vector of zeros of length total number of cities. Look at the logs bellow for clarity.
This feature will help us to characterize our data by patterns in the binary sequences that represent each search

In [25]:
def binarize_sequence(sequence_str):
    raw_sequence = [city.strip() for city in sequence_str.split(",")]
    integer_sequence = [0] * len(city_list)
    
    for city in raw_sequence:
        integer_sequence[city_list.index(city)] += 1
        
    return integer_sequence

In [26]:
df_flat['binary_sequence'] = df_flat['cities'].apply(binarize_sequence)

In [27]:
print('Original search: ' + str(df_flat['cities'].values[0]))
print('Tokenized search: ' + str(df_flat['city_integer_sequence'].values[0]))
print('Binarized search: ' + str(df_flat['binary_sequence'].values[0]))

Original search: New York NY, Newark NJ
Tokenized search: [51, 52]
Binarized search: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

#### Feature engineering : unix_timestamp

Let's create a new feature called 'timestamp' from 'unix_timestamp'. This feature will be of great use since it will allow us to see our data as a time series over the time range defined by the dates in it.

In [35]:
df_flat['timestamp'] = df_flat.apply(lambda row:pd.to_datetime( row['unix_timestamp'], unit = 's'), axis=1)
df_flat['timestamp'].describe()

count                   20022
unique                  20003
top       2015-09-25 08:44:47
freq                        2
first     2015-02-28 03:40:35
last      2015-10-02 00:48:22
Name: timestamp, dtype: object

In [41]:
# print(df_flat['joining_date'][:5])

In [42]:
df_flat['joining_date'] = pd.to_datetime(df_flat['joining_date'],infer_datetime_format=True)
df_flat['joining_date'].describe()

count                   20022
unique                     35
top       2015-03-02 00:00:00
freq                      857
first     2015-02-28 00:00:00
last      2015-04-03 00:00:00
Name: joining_date, dtype: object

#### Feature engineering : country_code

Let's create a feature that provides a numerical encoding for country so that we can visualize our more easily.

In [30]:
# Notice that the missing country is encoded as 0
country_color_dict = {'': 0, 'UK':1, 'DE':2, 'IT':3, 'ES':4, 'US':5, 'FR':6}

In [31]:
df_flat['country_code'] = df_flat.apply (lambda row: country_color_dict[row['country']], axis=1)

In [43]:
df_flat.head()

,session_id,unix_timestamp,cities,user_id,joining_date,country,cities_searched,city_integer_sequence,binary_sequence,timestamp,country_code
0,X061RFWB06K9V,1442503708,"New York NY, Newark NJ",2024,2015-03-22,UK,2,"[51, 52]","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",2015-09-17 15:28:28,1
1,5AZ2X2A9BHH5U,1441353991,"New York NY, Jersey City NJ, Philadelphia PA",2853,2015-03-28,DE,3,"[51, 33, 59]","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",2015-09-04 08:06:31,2
2,SHTB4IYAX4PX6,1440843490,San Antonio TX,10958,2015-03-06,UK,1,[71],"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",2015-08-29 10:18:10,1
3,JBRB8MZGTX3M4,1427268063,Edmonton AB,7693,2015-03-12,IT,1,[21],"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",2015-03-25 07:21:03,3
4,YJCMPURC2FL9C,1430559067,"Phoenix AZ, Houston TX",7506,2015-02-28,UK,2,"[60, 30]","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",2015-05-02 09:31:07,1

In [44]:
df_flat['city_integer_sequence'].describe()

count     20022
unique     1329
top        [51]
freq       2278
Name: city_integer_sequence, dtype: object

In [48]:
# df_flat.profile_report()

Lets group our data per user_id and country to see if we can find any relationships between the two.

In [156]:
df_grouped_userid_and_country = df_flat.groupby(['country', 'user_id'])
print(list(df_grouped_userid_and_country.groups.keys())[:3])

[('', '10019'), ('', '1002'), ('', '10029')]
['', 'DE', 'ES']

In [236]:
# from itertools import groupby

# def count_ocurrence_of_one_feature_into_another(dataframe, base_feature, secondary_feature ):
#     # List of countries with the unknown one as the first one
#     unique_countries = dataframe[base_feature].unique()
#     df_grouped = dataframe.groupby([base_feature, secondary_feature])
    
#     key_list = list(df_grouped.groups.keys())
#     # Group the secondary_feature values that belong to each value in base_feature
#     user_ids_per_country = {c: set() for c in unique_countries}

#     for key in key_list:
#         user_ids_per_country[key[0]].add(key[1])
        
#     return user_ids_per_country

# def analyze_groups(dataframe, base_feature):
#     df_grouped_country = dataframe.groupby(base_feature)
    
#     # See how secondary feature distributes over base_feature by taking each value in the later.
#     for key, group in df_grouped_country:
#         all_records = sorted(list(group['user_id'].values), reverse=True) 
#         if all_records:
#             print('Using *{}* to group {}'.format(key, secondary_feature))
#             # Create dictionary of repetitions of each element keyd by the feature value
#             repetitions_dict = {key : len(list(group)) for key, group in groupby(all_records)}
#             sorted_list_max = sorted(repetitions_dict.items(), key=lambda x: x[1], reverse=True)
#             sorted_list_min = sorted(repetitions_dict.items(), key=lambda x: x[1], reverse=False)
#             unique_records = set(all_records)

#             print('Total records {}'.format(len(all_records)))
#             print('Most repeted elements: {}'.format(sorted_list_max[:5]))
#             print('Least repeted elements: {}'.format(sorted_list_min[:5]))
#             print('Unique records {}'.format(len(unique_records)))
            
#         else:
#             print('No records found')
#         print('-------------')

In [245]:
from koalas import *

base_feature = 'country'
base_feature_unique = df_flat[base_feature].unique()

print('-----------------------------------------------------------------')
print('Base feature *{}* with {} unique values: {}'.format(base_feature, 
                                                   len(base_feature_unique),
                                                   base_feature_unique))
print('-----------------------------------------------------------------')

# Create quantitative statistics of each group
analyze_groups(df_flat, base_feature)

secondary_feature = 'user_id' # We'll loop here
user_ids_per_country = count_ocurrence_of_one_feature_into_another(df_flat, base_feature, secondary_feature)
userids_per_country_counts = [(k,len(val)) for k, val in user_ids_per_country.items()]

print('Different user ids per country: ' + str(userids_per_country_counts))
print('Unique *{}* per *{}*'.format(secondary_feature, base_feature))

print('-------------')

print('Intersection matrix')
print(base_feature_unique)
for country in base_feature_unique:
    
    print(str([len(user_ids_per_country[country].intersection(user_ids_per_country[c])) for c in df_flat['country'].unique()])
         + str(country))

-----------------------------------------------------------------
Base feature *country* with 7 unique values: ['UK' 'DE' 'IT' 'ES' '' 'US' 'FR']
-----------------------------------------------------------------
Using ** to group user_id
Total records 2820
Most repeted elements: [('8440', 9), ('7793', 9), ('7203', 9), ('336', 9), ('8816', 8)]
Least repeted elements: [('9936', 1), ('9896', 1), ('9629', 1), ('9586', 1), ('9458', 1)]
Unique records 792
-------------
Using *DE* to group user_id
Total records 3638
Most repeted elements: [('4404', 12), ('7363', 10), ('6508', 10), ('2300', 10), ('9929', 9)]
Least repeted elements: [('979', 1), ('9767', 1), ('9766', 1), ('9727', 1), ('97', 1)]
Unique records 1051
-------------
Using *ES* to group user_id
Total records 1953
Most repeted elements: [('7968', 9), ('7869', 9), ('813', 8), ('6537', 8), ('6133', 8)]
Least repeted elements: [('9945', 1), ('9753', 1), ('9741', 1), ('9604', 1), ('9580', 1)]
Unique records 569
-------------
Using *FR* to group user_id
Total records 2298
Most repeted elements: [('9252', 10), ('8398', 9), ('1238', 9), ('10648', 9), ('9537', 8)]
Least repeted elements: [('9888', 1), ('9875', 1), ('9865', 1), ('9662', 1), ('9570', 1)]
Unique records 665
-------------
Using *IT* to group user_id
Total records 1882
Most repeted elements: [('4082', 11), ('8430', 9), ('5519', 9), ('3852', 9), ('3283', 9)]
Least repeted elements: [('9916', 1), ('9760', 1), ('9640', 1), ('9546', 1), ('9176', 1)]
Unique records 528
-------------
Using *UK* to group user_id
Total records 3555
Most repeted elements: [('8000', 9), ('7233', 9), ('6518', 9), ('650', 9), ('388', 9)]
Least repeted elements: [('9871', 1), ('9796', 1), ('9771', 1), ('9765', 1), ('9659', 1)]
Unique records 1043
-------------
Using *US* to group user_id
Total records 3876
Most repeted elements: [('4314', 12), ('8075', 9), ('6083', 9), ('5928', 9), ('5893', 9)]
Least repeted elements: [('9970', 1), ('9836', 1), ('9722', 1), ('9708', 1), ('9677', 1)]
Unique records 1129
-------------
Different user ids per country: [('UK', 1043), ('DE', 1051), ('IT', 528), ('ES', 569), ('', 792), ('US', 1129), ('FR', 665)]
Unique *user_id* per *country*
-------------
Intersection matrix
['UK' 'DE' 'IT' 'ES' '' 'US' 'FR']
[1043, 0, 0, 0, 0, 0, 0]UK
[0, 1051, 0, 0, 0, 0, 0]DE
[0, 0, 528, 0, 0, 0, 0]IT
[0, 0, 0, 569, 0, 0, 0]ES
[0, 0, 0, 0, 792, 0, 0]
[0, 0, 0, 0, 0, 1129, 0]US
[0, 0, 0, 0, 0, 0, 665]FR

We now have one group of data for each possible conbination of user_id and country. Let's extract how many different user ids per country we have.

In [153]:
        
user_ids_per_country = count_ocurrence_of_one_feature_into_another(df_flat, 'country', 'user_id')
country = 'UK'
country_group_set = user_ids_per_country[country]
# print(country_group_set)
print('Grouping with: {}'.format(country))
print('Number of samples: {}'.format(len(country_group_set)))
country_group_float_list = [float(x) for x in list(country_group_set)]
print('Max :{}'.format(max(list(country_group_set))))
print('Min :{}'.format(min(list(country_group_set))))
# print('Mean :{}'.format(np.mean(country_group_float_list, dtype=np.float64)))



userids_per_country_counts = [(k,len(val)) for k, val in user_ids_per_country.items()]

print('Different user ids per country: ' + str(userids_per_country_counts))

# for country in df_flat['country'].unique():
#     print(str(country) + 
#           str([len(user_ids_per_country[country].intersection(user_ids_per_country[c])) for c in df_flat['country'].unique()]))

Grouping with: UK
Number of samples: 1043
Max :9995
Min :100
Different user ids per country: [('UK', 1043), ('DE', 1051), ('IT', 528), ('ES', 569), ('', 792), ('US', 1129), ('FR', 665)]

In [154]:
def feature_group_analysis(dataframe, feature_base):
    count = 0
    for feature in dataframe.columns:
        print('----------------------------')
        print('Analizing feature: {}'.format(feature))
        
        # List of countries with the unknown one as the first one
        unique_countries = df_flat[feature_base].unique()
        print('Will use feature :'+ str(feature_base) + ' to group data into ' + str(len(unique_countries)) + ' groups')
        print(unique_countries)
        df_grouped = df_flat.groupby([feature_base, feature])
        
        user_ids_per_country = count_ocurrence_of_one_feature_into_another(df_grouped)
        
        for value in dataframe[feature_base].unique():
            country_group_set = user_ids_per_country[value]
            print(type(country_group_set))
            print('Grouping {} with: {}'.format(feature, value))
#             print(df_grouped.get_group(value).shape)
            print('Number of unique values: {}'.format(len(country_group_set)))
#             country_group_float_list = [float(x) for x in list(country_group_set)]
            print('Max :{}'.format(max(list(country_group_set))))
            print('Min :{}'.format(min(list(country_group_set))))
            print('--------------')
#             userids_per_country_counts = [(k,len(val)) for k, val in country_group_set.items()]
#             print(userids_per_country_counts)
            
        count += 1
        
        if count > 2:
            break
        
feature_group_analysis(df_flat[['user_id', 'country']], 'country')

----------------------------
Analizing feature: user_id
Will use feature :country to group data into 7 groups
['UK' 'DE' 'IT' 'ES' '' 'US' 'FR']
<class 'set'>
Grouping user_id with: UK
Number of unique values: 1043
Max :9995
Min :100
--------------
<class 'set'>
Grouping user_id with: DE
Number of unique values: 1051
Max :9998
Min :10
--------------
<class 'set'>
Grouping user_id with: IT
Number of unique values: 528
Max :9916
Min :1001
--------------
<class 'set'>
Grouping user_id with: ES
Number of unique values: 569
Max :9994
Min :10000
--------------
<class 'set'>
Grouping user_id with:
Number of unique values: 792
Max :9984
Min :10019
--------------
<class 'set'>
Grouping user_id with: US
Number of unique values: 1129
Max :9983
Min :10005
--------------
<class 'set'>
Grouping user_id with: FR
Number of unique values: 665
Max :9987
Min :10013
--------------
----------------------------
Analizing feature: country
Will use feature :country to group data into 7 groups
['UK' 'DE' 'IT' 'ES' '' 'US' 'FR']
<class 'set'>
Grouping country with: UK
Number of unique values: 1
Max :UK
Min :UK
--------------
<class 'set'>
Grouping country with: DE
Number of unique values: 1
Max :DE
Min :DE
--------------
<class 'set'>
Grouping country with: IT
Number of unique values: 1
Max :IT
Min :IT
--------------
<class 'set'>
Grouping country with: ES
Number of unique values: 1
Max :ES
Min :ES
--------------
<class 'set'>
Grouping country with:
Number of unique values: 1
Max :
Min :
--------------
<class 'set'>
Grouping country with: US
Number of unique values: 1
Max :US
Min :US
--------------
<class 'set'>
Grouping country with: FR
Number of unique values: 1
Max :FR
Min :FR
--------------